# Ultralytics YOLO 🚀, AGPL-3.0 license
# Dual-stream YOLOv8 model with fusion capabilities

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # scales module repeats
width_multiple: 0.50  # scales convolution channels
channel_multiple: 8   # scaling factor for channel multiples

# YOLOv8 backbone
backbone:
  # [from, number, module, args]
  [
    [-1, 1, MultiStreamConv, [64, 6, 2, 2]], # 0-P1/2 - Initial dual stream convolution
    [-1, 1, MultiStreamConv, [128, 3, 2]],   # 1-P2/4 - Dual stream convolution with downsampling
    [-1, 3, MultiStreamC3, [128]],           # 2 - Dual stream C3 module
    [-1, 1, Fusion, ['concat', 2]],          # 3 - Fusion of dual streams (concat method with scale factor 2)
    [-1, 1, Conv, [256, 1, 1]],              # 4 - Adjust channels after fusion with 1x1 conv
    [-1, 1, Conv, [256, 3, 2]],              # 5-P3/8 - Standard path after fusion
    [-1, 6, C3, [256]],
    [-1, 1, Conv, [512, 3, 2]], # 7-P4/16
    [-1, 9, C3, [512]],
    [-1, 1, Conv, [1024, 3, 2]], # 9-P5/32
    [-1, 3, C3, [1024]],
    [-1, 1, SPPF, [1024, 5]], # 11
  ]

# YOLOv8 head
head:
  [
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],
    [[-1, 8], 1, Concat, [1]],  # cat backbone P4
    [-1, 3, C3, [512, False]],  # 14

    [-1, 1, nn.Upsample, [None, 2, 'nearest']],
    [[-1, 6], 1, Concat, [1]],  # cat backbone P3
    [-1, 3, C3, [256, False]],  # 17 (P3/8-small)

    [-1, 1, Conv, [256, 3, 2]],
    [[-1, 14], 1, Concat, [1]],  # cat head P4
    [-1, 3, C3, [512, False]],  # 20 (P4/16-medium)

    [-1, 1, Conv, [512, 3, 2]],
    [[-1, 11], 1, Concat, [1]],  # cat head P5
    [-1, 3, C3, [1024, False]],  # 23 (P5/32-large)

    [[17, 20, 23], 1, Detect, [nc]],  # Detect(P3, P4, P5)
  ]
