# Ultralytics YOLO 🚀, AGPL-3.0 license
# Dual-stream YOLOv8 model with fusion capabilities

# Parameters
nc: 28  # number of classes
# depth_multiple: 0.33  # scales module repeats
# width_multiple: 0.50  # scales convolution channels
# channel_multiple: 8   # scaling factor for channel multiples
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] # YOLOv8n summary: 129 layers, 3157200 parameters, 3157184 gradients, 8.9 GFLOPS
  s: [0.33, 0.50, 1024] # YOLOv8s summary: 129 layers, 11166560 parameters, 11166544 gradients, 28.8 GFLOPS
  m: [0.67, 0.75, 768] # YOLOv8m summary: 169 layers, 25902640 parameters, 25902624 gradients, 79.3 GFLOPS
  l: [1.00, 1.00, 512] # YOLOv8l summary: 209 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPS
  x: [1.00, 1.25, 512] # YOLOv8x summary: 209 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPS

# YOLOv8 backbone
backbone:
  # [from, number, module, args]
  [
    [-1, 1, SpatialAlignedMultiStreamConv, [64, 6, 2, 2]], # 0-P1/2 - Initial dual stream convolution
    [-1, 1, MultiStreamConv, [64, 3, 2]],   # 1-P2/4 - Dual stream convolution with downsampling
    [-1, 3, MultiStreamC3, [64]],           # 2 - Dual stream C3 module
    [-1, 1, Fusion, ['concat', 1]],          # 3 - Fusion of dual streams (concat method with scale factor 1)
    [-1, 1, Conv, [128, 1, 1]],              # 4 - Adjust channels after fusion with 1x1 conv
    [-1, 1, Conv, [128, 3, 2]],              # 5-P3/8 - Standard path after fusion
    [-1, 6, C3, [128]],
    [-1, 1, Conv, [256, 3, 2]], # 7-P4/16
    [-1, 9, C3, [256]],
    [-1, 1, Conv, [512, 3, 2]], # 9-P5/32
    [-1, 3, C3, [512]],
    [-1, 1, SPPF, [512, 5]], # 11
  ]

# YOLOv8 head
head:
  [
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 12
    [[-1, 8], 1, Concat, [1]],                   # 13: cat backbone P4 (index 8)
    [-1, 3, C2f, [256]],                         # 14: 512+256=768 -> 256

    [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 15
    [[-1, 6], 1, Concat, [1]],                   # 16: cat backbone P3 (index 6)
    [-1, 3, C2f, [128]],                         # 17: 256+128=384 -> 128 (P3/8-small)

    [-1, 1, Conv, [128, 3, 2]],                  # 18
    [[-1, 14], 1, Concat, [1]],                  # 19: cat head P4
    [-1, 3, C2f, [256]],                         # 20: 128+256=384 -> 256 (P4/16-medium)

    [-1, 1, Conv, [256, 3, 2]],                  # 21
    [[-1, 11], 1, Concat, [1]],                  # 22: cat head P5
    [-1, 3, C2f, [512]],                         # 23: 256+512=768 -> 512 (P5/32-large)

    [[17, 20, 23], 1, Detect, [nc]],             # 24: Detect(P3, P4, P5)
  ]